## Estadística Aplicada
Sesión 3 - 15 Agosto

Cinthia Zaydé García Belmonte 2076329

## Tuplas
es una colección de objetos inmutables (no se puede cambiar)

In [1]:
tupla_alumno = ('Zaydé', 'García', 22)

In [2]:
type(tupla_alumno)

tuple

In [3]:
tupla_alumno[1]

'García'

##  Diccionarios (mapeo de valores)
claves-valor
variables-valor

In [6]:
dic1_alumno = {'Nombre': 'Zaydé', 'Apellido': 'García'}

In [5]:
type(dic1_alumno)

dict

In [7]:
grupo_g44 = {'Nombre': ['Ricardo', 'Ale', 'Jimena'], 'Apellido': ['Perez', 'Peña', 'Huerta']}

In [8]:
grupo_g44

{'Nombre': ['Ricardo', 'Ale', 'Jimena'],
 'Apellido': ['Perez', 'Peña', 'Huerta']}

In [9]:
grupo_g44['Nombre']

['Ricardo', 'Ale', 'Jimena']

In [10]:
grupo_g44.keys()

dict_keys(['Nombre', 'Apellido'])

In [11]:
grupo_g44.values()

dict_values([['Ricardo', 'Ale', 'Jimena'], ['Perez', 'Peña', 'Huerta']])

## Pandas
Para manejar datos estructurados 

Pandas esta construida sobre numpy, por tanto las funciones de numpy se pueden usar en pandas. 

Pandas nos ofrece 3 tipos de datos:
1. Series (Unidimensionales)
2. Dataframes (Filas y Columnas)
3. Panel (tiempo como variabe)

Conocemos la edad de 4 personas: Juan 23, Jimena 21, Jorge 9 y Ricardo 15

In [12]:
edades = [23, 21, 9, 15]

In [13]:
edades

[23, 21, 9, 15]

In [15]:
import pandas as pd

In [17]:
serie_edades = pd.Series(edades, index = ['Juan', 'Jimena', 'Jorge', 'Ricardo'])

In [18]:
type(serie_edades)

pandas.core.series.Series

In [19]:
serie_edades

Juan       23
Jimena     21
Jorge       9
Ricardo    15
dtype: int64

In [20]:
serie_edades.mean()

17.0

In [21]:
serie_edades.std(ddof=1).round(1)

6.3

In [22]:
serie_edades.median()

18.0

## DataFrames
Datos organizados en filas y columnas (excel)

In [40]:
alumno1 = ['Juan', 'Perez', 23]
alumno2 = ['Raúl', 'González', 17]
alumno3 = ['Jimena', 'Rosas', 20]
alumno4 = ['Alejandra', 'Saldaña', 21]

In [45]:
clase_estadistica = [alumno1, alumno2, alumno3, alumno4]

In [46]:
clase_estadistica

[['Juan', 'Perez', 23],
 ['Raúl', 'González', 17],
 ['Jimena', 'Rosas', 20],
 ['Alejandra', 'Saldaña', 21]]

In [47]:
df_clase = pd.DataFrame(clase_estadistica, columns=['Nombre', 'Apellido','Edad'])

In [48]:
df_clase

      Nombre  Apellido  Edad
0       Juan     Perez    23
1       Raúl  González    17
2     Jimena     Rosas    20
3  Alejandra   Saldaña    21

In [49]:
df_clase.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [33]:
df_clase.index

RangeIndex(start=0, stop=4, step=1)

In [50]:
df_clase['Edad en días']  = df_clase['Edad'] * 365

In [51]:
df_clase

      Nombre  Apellido  Edad  Edad en días
0       Juan     Perez    23          8395
1       Raúl  González    17          6205
2     Jimena     Rosas    20          7300
3  Alejandra   Saldaña    21          7665

## Selección elemntos e dataframe
1. Estandar
2. .iloc
3. loc
4. Condicionales

In [52]:
#Estandar
df_clase['Edad']

0    23
1    17
2    20
3    21
Name: Edad, dtype: int64

In [53]:
df_clase[['Nombre', 'Edad']]

      Nombre  Edad
0       Juan    23
1       Raúl    17
2     Jimena    20
3  Alejandra    21

In [54]:
df_clase[0:2]

  Nombre  Apellido  Edad  Edad en días
0   Juan     Perez    23          8395
1   Raúl  González    17          6205

In [55]:
df_clase[0:2]['Edad']

0    23
1    17
Name: Edad, dtype: int64

## Selección por .iloc (posicion)
Dataframe.iloc[filas, columnas]

In [58]:
df_clase.iloc[0,[0,1]]

Nombre       Juan
Apellido    Perez
Name: 0, dtype: object

## Selección por .loc (etiquetas)
dataframe.loc[nombre filas, nombre columnas]

In [59]:
df_clase.loc[:, 'Edad']

0    23
1    17
2    20
3    21
Name: Edad, dtype: int64

In [60]:
# cambiar el index
df_clase = df_clase.set_index('Nombre')

In [61]:
df_clase

           Apellido  Edad  Edad en días
Nombre
Juan          Perez    23          8395
Raúl       González    17          6205
Jimena        Rosas    20          7300
Alejandra   Saldaña    21          7665

In [62]:
df_clase.loc['Juan', 'Apellido']

'Perez'

In [64]:
## Seleción SQL
df_clase.Edad

Nombre
Juan         23
Raúl         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

## Seleccion Condicional
dataframe[condicion]

In [66]:
df_clase[df_clase['Edad']>=18]

          Apellido  Edad  Edad en días
Nombre
Juan         Perez    23          8395
Jimena       Rosas    20          7300
Alejandra  Saldaña    21          7665

## Funciones Pandas

In [67]:
### sort_values, default es de menos a mayor
df_clase.sort_values('Edad')

           Apellido  Edad  Edad en días
Nombre
Raúl       González    17          6205
Jimena        Rosas    20          7300
Alejandra   Saldaña    21          7665
Juan          Perez    23          8395

In [68]:
#de mayor a menor
df_clase.sort_values('Edad', ascending=False)

           Apellido  Edad  Edad en días
Nombre
Juan          Perez    23          8395
Alejandra   Saldaña    21          7665
Jimena        Rosas    20          7300
Raúl       González    17          6205

In [69]:
df_clase.sort_values(['Nombre', 'Edad'])

           Apellido  Edad  Edad en días
Nombre
Alejandra   Saldaña    21          7665
Jimena        Rosas    20          7300
Juan          Perez    23          8395
Raúl       González    17          6205

In [70]:
##
df_clase['Edad'].mean()

20.25

In [71]:
## np.where
import numpy as np

In [72]:
## np.where (condición, valor si se cumple, valor si no se cumple)
df_clase['mayoria_edad'] = np.where(df_clase['Edad'] >= 18, 'Mayor', 'Menor')

In [73]:
df_clase

           Apellido  Edad  Edad en días mayoria_edad
Nombre
Juan          Perez    23          8395        Mayor
Raúl       González    17          6205        Menor
Jimena        Rosas    20          7300        Mayor
Alejandra   Saldaña    21          7665        Mayor

In [74]:
## np.slect 
# condiciones, valor cada condición, valor si no se cumple ninguna condición

condiciones = [ df_clase['Edad'] <= 17,
                df_clase['Edad'] < 23,
                df_clase['Edad'] >= 23]

valores = ['Prepa', 'Universidad', 'Trabajando']

df_clase['Situacion'] = np.select(condiciones, valores, default='Invalido')

In [75]:
df_clase

           Apellido  Edad  Edad en días mayoria_edad    Situacion
Nombre
Juan          Perez    23          8395        Mayor   Trabajando
Raúl       González    17          6205        Menor        Prepa
Jimena        Rosas    20          7300        Mayor  Universidad
Alejandra   Saldaña    21          7665        Mayor  Universidad

In [77]:
#contar
df_clase['mayoria_edad'].count()

4

In [81]:
df_clase.groupby('mayoria_edad').count()['Edad']

mayoria_edad
Mayor    3
Menor    1
Name: Edad, dtype: int64

In [83]:
df_clase.groupby('mayoria_edad').mean(numeric_only=True).round(1)

              Edad  Edad en días
mayoria_edad
Mayor         21.3        7786.7
Menor         17.0        6205.0